import random

def вибрати_карту():
    """Функція для отримання випадкової карти."""
    карти = ['2', '3', '4', '5', '6', '7', '8', '9', '10', 'J', 'Q', 'K', 'A']
    return random.choice(карти)

def розрахувати_значення_руки(рука):
    """Функція для розрахунку значення руки."""
    значення = {'2': 2, '3': 3, '4': 4, '5': 5, '6': 6, '7': 7, '8': 8, '9': 9, '10': 10, 'J': 10, 'Q': 10, 'K': 10, 'A': 11}
    значення_руки = 0
    кількість_тузів = 0

    for карта in рука:
        значення_руки += значення[карта]
        if карта == 'A':
            кількість_тузів += 1

    while кількість_тузів > 0 and значення_руки > 21:
        значення_руки -= 10
        кількість_тузів -= 1

    return значення_руки

def main():
    рука_гравця = []
    while True:
        вибір = input("Бажаєте взяти карту? (так/ні): ").lower()

        if вибір != 'так':
            break

        карта = вибрати_карту()
        рука_гравця.append(карта)
        print(f"Ваша рука: {', '.join(рука_гравця)}")
        значення_руки = розрахувати_значення_руки(рука_гравця)
        print(f" Сума  ваших карт: {значення_руки}")

        if значення_руки > 21:
            print("Перебір! Ви програли.")
            break

    print("Гра завершена.")

if __name__ == "__main__":
    main()